; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-6)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(free left)
(free right)
(at ball1 rooma)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room4)
(at ball6 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
)
)
)

; plan
1. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 1 of 6
2. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 1 of 6
3. (pick ball6 room6 right)
   deleted: (at ball6 room6) (free right)
   added: (carry ball6 right)
   goals met: 1 of 6
4. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 1 of 6
5. (drop ball6 room4 right)
   deleted: (carry ball6 right)
   added: (at ball6 room4) (free right)
   goals met: 2 of 6
6. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 3 of 6
7. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 3 of 6
8. (pick ball4 room3 left)
   deleted: (at ball4 room3) (free left)
   added: (carry ball4 left)
   goals met: 3 of 6
9. (pick ball3 room3 right)
   deleted: (at ball3 room3) (free right)
   added: (carry ball3 right)
   goals met: 3 of 6
10. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 3 of 6
11. (drop ball3 room4 right)
   deleted: (carry ball3 right)
   added: (at ball3 room4) (free right)
   goals met: 4 of 6
12. (drop ball4 room4 left)
   deleted: (carry ball4 left)
   added: (at ball4 room4) (free left)
   goals met: 5 of 6
13. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 5 of 6
14. (pick ball2 room3 left)
   deleted: (at ball2 room3) (free left)
   added: (carry ball2 left)
   goals met: 5 of 6
15. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 5 of 6
16. (drop ball2 room4 left)
   deleted: (carry ball2 left)
   added: (at ball2 room4) (free left)
   goals met: 6 of 6
